verification/runs/F14-cooling-ladder/K0cT_runs/M_hi_f_LS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.00000000 0.00000000 0.00000000)
    (0.07600000 0.00000000 0.00000000)
    (0.00000000 2.18000000 0.00000000)
    (0.07600000 2.18000000 0.00000000)
    (0.00000000 0.00000000 0.01000000)
    (0.07600000 0.00000000 0.01000000)
    (0.00000000 2.18000000 0.01000000)
    (0.07600000 2.18000000 0.01000000)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (64 192 1)
    simpleGrading
    (
        (
            (0.5 0.5 33.432279)
            (0.5 0.5 0.02991121)
        )
        1
        1
    )
);

edges();

boundary
(
    coldWall
    {
        type wall;
        faces ( (0 4 6 2) );
    }
    hotWall
    {
        type wall;
        faces ( (1 3 7 5) );
    }
    bottomWall
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    topWall
    {
        type wall;
        faces ( (2 6 7 3) );
    }
    frontAndBack
    {
        type empty;
        faces ( (0 2 3 1) (4 5 7 6) );
    }
);

// ************************************************************************* //
